In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({
    'one':pd.Series(np.random.randn(3), index = ['a','b','c']),
    'two':pd.Series(np.random.randn(4), index = ['a','b','c','d']),
    'three':pd.Series(np.random.randn(3), index = ['b','c','d'])
})

In [4]:
df2 = df.copy()

In [5]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [6]:
df.ne(df2)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [7]:
df

        one       two     three
a -1.565734  0.645320       NaN
b  1.334217 -0.637275 -0.801365
c  1.555507  1.369770 -1.591751
d       NaN  1.001389 -0.081560

In [8]:
(df>0).all()

one      False
two      False
three    False
dtype: bool

In [9]:
(df>0).any()

one       True
two       True
three    False
dtype: bool

In [10]:
pd.Series([True]).bool()

True

In [11]:
pd.Series(['foo','bar','baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [12]:
pd.Series(['foo','bar','baz']) ==pd.Series(['foo','bar','qux'])

0     True
1     True
2    False
dtype: bool

In [13]:
df + df

        one       two     three
a -3.131467  1.290639       NaN
b  2.668433 -1.274550 -1.602730
c  3.111014  2.739540 -3.183502
d       NaN  2.002777 -0.163121

In [15]:
(df + df == df * 2).all().all()

False

In [16]:
df.mean()

one      0.441330
two      0.594801
three   -0.824892
dtype: float64

In [17]:
df.mean(1)

a   -0.460207
b   -0.034808
c    0.444509
d    0.459914
dtype: float64

In [19]:
ts_stand = (df - df.mean()) / df.std()

In [20]:
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [21]:
series  = pd.Series(np.random.rand(1000))

In [22]:
series[::2] = np.nan

In [23]:
series.describe()

count    500.000000
mean       0.498692
std        0.283482
min        0.003263
25%        0.253056
50%        0.493614
75%        0.746958
max        0.998782
dtype: float64

In [24]:
frame = pd.DataFrame(np.random.rand(1000, 5), columns = 
                    ['a','b','c','d','e'])

In [25]:
frame.describe()

                 a            b            c            d            e
count  1000.000000  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.500463     0.481387     0.486548     0.496819     0.507075
std       0.284201     0.287865     0.284603     0.282497     0.288869
min       0.000189     0.000136     0.001479     0.002929     0.001515
25%       0.252719     0.229271     0.244275     0.252026     0.252928
50%       0.498693     0.481248     0.479329     0.497906     0.515350
75%       0.745806     0.717168     0.731022     0.732538     0.753474
max       0.998889     0.997093     0.999250     0.997253     0.999471

In [26]:
s = pd.Series(['a', 'a', 'b', 'b', 'a', 'a', np.nan, 'c', 'd', 'a'])

In [27]:
s.describe()

count     9
unique    4
top       a
freq      5
dtype: object

In [30]:
s1 = pd.Series(np.random.rand(5))

In [31]:
s1.idxmin(),s1.idxmax()

(1, 4)

In [32]:
df1 = pd.DataFrame(np.random.randn(5,3), columns=['A','B','C'])

In [33]:
df1

          A         B         C
0 -1.482561  0.105186 -0.560517
1 -0.156766 -0.513094  0.168334
2  0.335653 -1.274373 -0.397274
3 -2.084076  0.360313  2.075041
4  0.238226 -0.303085 -0.806521

In [34]:
df1.idxmin(axis=0)

A    3
B    2
C    4
dtype: int64

In [35]:
df1.idxmax(axis=1)

0    B
1    C
2    A
3    C
4    A
dtype: object

In [37]:
df = pd.DataFrame({'col1': np.random.randn(3),
                  'col2': np.random.randn(3)}, index=['a','b','c'])

for col in df:
    print(col)

col1
col2

In [41]:
df = pd.DataFrame({'a': [1,2,3], 'b':['a','b','c']})

In [42]:
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [43]:
for label, ser in df.items():
    print(label)
    print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [45]:
for row_index,row in df.iterrows():
    print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [46]:
for row in df.itertuples():
    print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')